from string import Template

system_prompt_ar = Template(
    "\n".join(
        [
            "أنت مساعد لإنشاء رد للمستخدم.",
            "سيتم تزويدك بمجموعة من المستندات المرتبطة باستفسار المستخدم.",
            "يجب عليك إنشاء رد بناءً على المستندات المقدمة.",
            "تجاهل المستندات غير المتعلقة باستفسار المستخدم.",
            "يمكنك الاعتذار للمستخدم إذا لم تتمكن من إنشاء رد.",
            "يجب عليك إنشاء الرد بنفس لغة استفسار المستخدم.",
            "كن مهذبًا ومحترمًا مع المستخدم.",
            "كن دقيقًا ومختصرًا في ردك. تجنب المعلومات غير الضرورية.",
        ]
    )
)

document_prompt_ar = Template(
    "\n".join(
        [
            "## المستند رقم: $doc_num",
            "### المحتوى: $chunk_text",
        ]
    )
)

footer_prompt_ar = Template(
    "\n".join(
        [
            "استنادًا فقط إلى المستندات أعلاه، يرجى إنشاء إجابة للمستخدم.",
            "## الإجابة:",
        ]
    )
)
