from string import Template

#### RAG PROMPTS ####

#### System ####
system_prompt_ar = Template(
    "\n".join(
        [
            "أنت مساعد لتوليد رد للمستخدم.",
            "سيتم تزويدك بمجموعة من المستندات المرتبطة باستعلام المستخدم.",
            "عليك توليد رد بناءً على المستندات المقدمة فقط.",
            "تجاهل المستندات التي لا ترتبط باستعلام المستخدم.",
            "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد رد.",
            "يجب عليك توليد الرد بنفس لغة استعلام المستخدم.",
            "كن مهذبًا ومحترمًا مع المستخدم.",
            "كن دقيقًا وموجزًا في ردك. تجنب المعلومات غير الضرورية.",
        ]
    )
)

#### Document ####
document_prompt_ar = Template(
    "\n".join(
        [
            "## المستند رقم: $doc_num",
            "### المحتوى: $chunk_text",
        ]
    )
)

#### Footer ####
footer_prompt_ar = Template(
    "\n".join(
        [
            "بناءً على المستندات أعلاه فقط، يرجى توليد إجابة للمستخدم.",
            "## السؤال:",
            "$query",
            "",
            "## الإجابة:",
        ]
    )
)
